In [1]:
%load_ext sql

In [2]:
%sql sqlite:////Users//samue//Desktop//Bootcamp//lab-sql-select//publications.db

'Connected: @/Users//samue//Desktop//Bootcamp//lab-sql-select//publications.db'

In [3]:
# CHALLENGE 1

In [8]:
%%sql
select t.title_id, t.price, t.advance, t.royalty, s.qty, a.au_id, ta.royaltyper, (t.price * s.qty * t.royalty * ta.royaltyper / 10000) as ROYALTIES
from titles t
inner join sales s on s.title_id = t.title_id
inner join titleauthor ta on ta.title_id = s.title_id
inner join authors a on a.au_id = ta.au_id
order by t.title_id, a.au_id;

select title_id, au_id, au_lname, au_fname, advance, sum(ROYALTIES) as ROYALTIES from 
(
	select t.title_id, t.price, t.advance, t.royalty, s.qty, a.au_id, au_lname, au_fname, ta.royaltyper, (t.price * s.qty * t.royalty * ta.royaltyper / 10000) as ROYALTIES
	from titles t
	inner join sales s on s.title_id = t.title_id
	inner join titleauthor ta on ta.title_id = s.title_id
	inner join authors a on a.au_id = ta.au_id
) as tmp
group by au_id, title_id
order by ROYALTIES desc;

select au_id as "AUTHOR ID", au_lname as "LAST NAME", au_fname as "FIRST NAME", sum(advance + ROYALTIES) as PROFITS from 
(
	select title_id, au_id, au_lname, au_fname, advance, sum(ROYALTIES) as ROYALTIES from (
		select t.title_id, t.price, t.advance, t.royalty, s.qty, a.au_id, au_lname, au_fname, ta.royaltyper, (t.price * s.qty * t.royalty * ta.royaltyper / 10000) as ROYALTIES
		from titles t
		inner join sales s on s.title_id = t.title_id
		inner join titleauthor ta on ta.title_id = s.title_id
		inner join authors a on a.au_id = ta.au_id
	) as tmp
	group by au_id, title_id
) as tmp2
group by au_id
order by PROFITS desc
limit 3

 * sqlite:////Users//samue//Desktop//Bootcamp//lab-sql-select//publications.db
Done.
Done.
Done.

[('899-46-2035', 'Ringer', 'Anne', 17353.131999999998),
 ('213-46-8915', 'Green', 'Marjorie', 15162.11),
 ('722-51-5454', 'DeFrance', 'Michel', 15021.528)]

In [9]:
# CHALLENGE 2